{
  "intents": [
    {
      "patterns": [
        "How to generate the Dockerfile from an official image?",
        "Is it possible to create Dockerfile from the container/image?",
        "If I have locally docker image. How Could I list what is installed on it?"
      ],
      "responses": [
        "19104847"
      ],
      "tag": "19104847"
    },
    {
      "patterns": [
        "Docker port networking",
        "Dynamically bind and unbind TCP port in a running docker container",
        "How to can I edit Docker port and args on a container? (using Dockers Desktop for Windows)",
        "Docker: Expose running container to host"
      ],
      "responses": [
        "19335444"
      ],
      "tag": "19335444"
    },
    {
      "patterns": [
        "Docker rm command throws error when using $()",
        "unknown shorthand flag: 'a' in -aq",
        "What is wrong with the Docker command to remove all containers?"
      ],
      "responses": [
        "53559545"
      ],
      "tag": "53559545"
    },
    {
      "patterns": [
        "docker container ports confusion",
        "What is the use of Expose in docker file for ASP.NET Core application",
        "What is the purpose of the EXPOSE command in a Dockerfile?",
        "Why expose port is not used in Dockerfile?",
        "Difference between -p during image run and EXPOSE in dockerfile"
      ],
      "responses": [
        "22111060"
      ],
      "tag": "22111060"
    },
    {
      "patterns": [
        "Connecting to host machine with non static ip from docker-container",
        "How to make my docker container call my API that is im my docker host?",
        "How can a container connect to a service on the docker host?",
        "How can I retrieve my host machines IP address from inside a docker compose file?",
        "docker container can not connect to local postgres",
        "Expose laptop localhost port to Docker container",
        "How to access localhost API's inside docker container?",
        "Docker django connect non docker postgresql",
        "Sending a request from inside a docker container to a host spring server",
        "How to get rid of the port when `host.docker.internal` to interact with a service running locally on my machine",
        "How can I configure my docker-compose for connect my 'app' running in docker containner to my 'database' running in physical machine",
        "Dockerized Django project not able to connect to host's postgres database",
        "How connect to localhost mysql base from docker in spring application",
        "How to connect External mysql DB to Docker Web Container",
        "connect ECONNREFUSED 127.0.0.1:3000 error using Docker container",
        "Connecting docker container to mongodb on localhost",
        "Connect between client docker and postgres server on host",
        "Can't connect to db from docker container",
        "Dockerized springboot app connect to main MySQL",
        "docker access outer localhost (host) ip from inside container [windows]",
        "How to access host machine's mongo db inside docker container",
        "connect kafka from host inside python app with docker",
        "Connecion to mysql on host machine from a docker container not possible",
        "Docker - Connect containers to local database",
        "how to enable containers from docker-compose \"bridge\" network to reach out to service running on Docker host?",
        "MySQL connection error with native database",
        "translate localhost to host's localhost inside a docker container",
        "Docker container can't connect to the host machine database",
        "how do I connect a docker container to local redis server running on the host",
        "Accessing a service host from inside a container",
        "Can't connect node container to mysql (locally hosted mysql)?",
        "Connection between node.js docker container and local redis server(127.0.0.1)",
        "Communication between Docker Application and localhost application",
        "Docker How to allow access to local ports in container?",
        "How to send http request from docker container to the local machine?",
        "connect php docker container to existing apache and mysql (both are not in a container)",
        "How to connect from docker-compose to host",
        "how does containered springboot image connect itself to mysql5.7 which runs locally?",
        "Docker TCP client",
        "Connection to localhost refused while running dockerised app",
        "docker windows : how to access my localhost",
        "How to share local Postgres database with docker?",
        "How to connect from Docker container parse-server to a host Postgresql DB?",
        "Connect Docker image to local Postgres",
        "Redis connect ECONNREFUSED 127.0.0.1:6379",
        "How to use services such as Kafka, Zookeeper and Postgres of the host sever inside a docker using docker compose?"
      ],
      "responses": [
        "24319662"
      ],
      "tag": "24319662"
    },
    {
      "patterns": [
        "Error response from daemon: the daemon on this operating system does not support exporting Windows containers",
        "How can i make docker to pull image from another host machine's local repository?",
        "Is there a way to seamlessly transfer docker-compose containers to another host without building?",
        "How to locally export docker image from a machine X and import and run it on machine Y?"
      ],
      "responses": [
        "23935141"
      ],
      "tag": "23935141"
    },
    {
      "patterns": [
        "change location of image which is pulled in docker-compose",
        "Docker does not see all disks - No space left on device",
        "Run Docker image on /dev/shm partition"
      ],
      "responses": [
        "24309526"
      ],
      "tag": "24309526"
    },
    {
      "patterns": [
        "How can I include python module from an outer folder in the docker image?",
        "Docker build: runnable is in parent folder",
        "problem with Dockerfile copy folder error with absolute or relative path",
        "Copy file with absolute path to Docker Container using a Dockerfile",
        "How to copy files when files are in different folder than the dockerfile?",
        "How to create a path when copying in a dockerfile?",
        "Dockerfile - How to copy files from a local folder?",
        "COPY command in Dockerfile. How to copy from one level up",
        "Running docker when dockerfile is in folder inside a project and the solution includes multiple projects",
        "Dockerfile: Copy directory from outside of docker folder",
        "Dockerfile copy to one folder up",
        "dockefile-copy from absolute path",
        "Dockerfile Service failed to build: COPY failed: Forbidden path outside the build context: ../../../../*"
      ],
      "responses": [
        "27068596"
      ],
      "tag": "27068596"
    },
    {
      "patterns": [
        "What files are produced by Docker's build command and where are they stored?",
        "Where on my drive is my docker image? (It's not under /)",
        "Where is the location of images that i pulled from docker hub on my windows?"
      ],
      "responses": [
        "19234831"
      ],
      "tag": "19234831"
    },
    {
      "patterns": [
        "Docker container crontab not running",
        "How can I automatically start cron in a Docker container that is running PHP?",
        "The crontab not running inside container",
        "How to run a python cron application with docker?"
      ],
      "responses": [
        "37458287"
      ],
      "tag": "37458287"
    },
    {
      "patterns": [
        "'docker image ls' gives huge <none> image list",
        "How To Remove Anonymous Image In Docker?",
        "docker image prune not removing intermediate images",
        "Docker remove image and container before creating"
      ],
      "responses": [
        "33913020"
      ],
      "tag": "33913020"
    },
    {
      "patterns": [
        "Flask + Nginx reverse proxy refuses to connect in docker containers",
        "docker not able to start flask application",
        "Not able to access running server on docker in uvicorn",
        "How to view Dash app running in docker container",
        "Dockerized Python Flask REST API displays \"The page isn't working",
        "Can't see my running Docker Container on localhost",
        "I have a web app running inside a docker container, how do I access it on localhost?",
        "unable to connect to flask docker image",
        "set up flask with docker",
        "Unable to connect to flask while running on docker container",
        "Why can't I connect to my Flask server after it's deployed in a Docker container?",
        "How to publish flask port from container to host",
        "\"Docker-compose run\" shows backend running but can't access from host",
        "build docker image for datetime flask api in python",
        "Flask API endpoint is not accessible from docker",
        "Can't connect to docker container on localhost",
        "Docker Container server not sending data",
        "Run docker container on localhost",
        "Container works but localhost says unable to connect",
        "Imports not working with Flask in Docker (no gunicorn!)",
        "Flask app not exposed properly on localhost",
        "Python package run in Docker results in ERR_EMPTY_RESPONSE",
        "Can't access React and Flask services created by Docker-Compose on Windows 10",
        "docker-compose ports not mapping; logs shows app is running",
        "docker container on windows does not give any response"
      ],
      "responses": [
        "30323224"
      ],
      "tag": "30323224"
    },
    {
      "patterns": [
        "Can I combine these two docker images?",
        "Is it possible to build a docker container with two hub images (Python 3.7.3 and Ubuntu 18.0.4)?",
        "Use features from different base dockers",
        "Two docker images into a single docker image",
        "Make a new container with a combination of two separate containers"
      ],
      "responses": [
        "27214757"
      ],
      "tag": "27214757"
    },
    {
      "patterns": [
        "Unable to connect from Java to kafka running inside docker container",
        "Connecting Kafka Producer to Kafka broker in Docker container through Java libraries",
        "KafkaStreamApi in Docker worked, but don't consume record",
        "Running clickhouse and Kafka in docker",
        "cant read\\write from kafka topic",
        "Kafka failing to connect broker on docker",
        "KafkaProducer not reading messages",
        "\"kafka.errors.NoBrokersAvailable: NoBrokersAvailable\" problem",
        "Configuring listener with \"localhost\" causes a failure to retrieve meta data about the broker",
        "Docker and VS Code Remote Containers : How to connect remote Python dev container with Kafka container",
        "Spring Boot connect to Kafka Brokers",
        "Spring boot and Apache Kafka via Docker compose throw LEADER_NOT_AVAILABLE of topic and Send failed error",
        "java with kafka docker image Broker may not be available.Error",
        "kafka docker works well on localhost but not on a remote server",
        "How do i connect my containerised project to kafka running on localhost?",
        "Can't correctly send to kafka-docker from network device",
        "Kafka - Consumer failed to start: Connection refused - connect(2) for 127.0.0.1:9092",
        "Spring can't find running kafka image",
        "How to solve kafka.errors.KafkaTimeoutError: KafkaTimeoutError: Failed to update metadata after 60.0 secs?",
        "How to fix error: kafka.errors.NoBrokersAvailable: NoBrokersAvailable?",
        "Unable to create Kafka topics with Kafka and Zookeeper running on Docker",
        "kafka container - Connection to node -1 (localhost/127.0.0.1:9092) could not be established. Broker may not be available",
        "Can't Connect to Kafka running on Docker",
        "org.apache.spark.SparkException: java.nio.channels.ClosedChannelException",
        "Can not connect to Kafka outside container",
        "Accessing Kafka broker in Docker container",
        "Kafdrop - Cannot connect to Kafka Cluster setup using bitnami/kafka",
        "How to access Docker Kafka from host machine",
        "Spring Kafka Group Coordinator is invalid or unavailable"
      ],
      "responses": [
        "51630260"
      ],
      "tag": "51630260"
    },
    {
      "patterns": [
        "Django Docker app container don't open on browser after run",
        "Run docker container with official postgres image, failed to access the container",
        "Docker container doesn't connect to host",
        "localhost rejects requests to a simple Docker-run node app"
      ],
      "responses": [
        "42866013"
      ],
      "tag": "42866013"
    },
    {
      "patterns": [
        "Error: pg_config executable not found in Postgres Docker container",
        "Unable to install Psycopg2 in Docker alpine image",
        "Problem creating a Docker container for Flask web application",
        "Docker build getting errors after I tried to install pip install -r requirements.txt file"
      ],
      "responses": [
        "46711990"
      ],
      "tag": "46711990"
    },
    {
      "patterns": [
        "How to connect to Docker containers using hostnames from Docker host?",
        "How do I make a Docker Compose alias available to the local machine?",
        "How do I publish and access jenkins docker container from browser?"
      ],
      "responses": [
        "37242217"
      ],
      "tag": "37242217"
    },
    {
      "patterns": [
        "How to start a nginx Docker container?",
        "Docker build in command prompt",
        "Docker Installation Error on Step 1/11 ./bin/acore-docker-build"
      ],
      "responses": [
        "48066994"
      ],
      "tag": "48066994"
    },
    {
      "patterns": [
        "Updating kubernetes deployment with same image name",
        "Forcing Kubernetes to redeploy a deployment YAML if docker image updates?",
        "Kubernetes not updates Docker image on redeployment"
      ],
      "responses": [
        "40366192"
      ],
      "tag": "40366192"
    },
    {
      "patterns": [
        "Jenkins inside a container do not find docker command",
        "Unable to bind docker.sock to Docker Service",
        "Docker and Jenkins integration",
        "How to use Docker in Jenkins from Docker (DIND: Docker in Docker)?"
      ],
      "responses": [
        "44850565"
      ],
      "tag": "44850565"
    },
    {
      "patterns": [
        "Connecting to Postgres docker container from docker-compose file",
        "Docker endpoint other compose file",
        "Docker-Compose connect service to another network",
        "Communication between 2 Docker Composes using Network results in \"SequelizeHostNotFoundError\""
      ],
      "responses": [
        "38088279"
      ],
      "tag": "38088279"
    },
    {
      "patterns": [
        "phantom jvm memory usage, native allocations, and sizing k8s pods",
        "Why is the java process user more memory than -XX:MaxRAM?",
        "Java memory usage much higher than heap+nonheap",
        "why JVM Current old generation capacity + new generation capacity+Metaspace capacity not equals physical memory",
        "What non-heap memory allocations does the JVM makes?",
        "java process consumes more memory over time but no memory leak",
        "JVM in pod high memory usage",
        "Java memory leak in non-heap space",
        "What is affecting the JVM memory allocation to go beyond -Xmx?",
        "K8s Pod memory is higher than JVM heap size",
        "How to limit JVM memory consumption?",
        "Java process memory used 3.2GB, but heap used only 1053MB, I want to know how to solve this"
      ],
      "responses": [
        "53451103"
      ],
      "tag": "53451103"
    },
    {
      "patterns": [
        "PyQt5 could not load the platform plugin xcb",
        "Could not load QT platform plugin \"xcb\"",
        "Could not load Qt platform plugin \"Ubuntu 20.04\""
      ],
      "responses": [
        "24095968"
      ],
      "tag": "24095968"
    },
    {
      "patterns": [
        "How to configure spring-boot microservice docker container to access local mongodb database?",
        "Access Web Application running on host on Docker Container",
        "Connect to a local PostgreSQL database from a docker-compose service",
        "How would I connect to a MySQL on the host machine from inside a docker kubernetes pod?"
      ],
      "responses": [
        "31324981"
      ],
      "tag": "31324981"
    },
    {
      "patterns": [
        "Is it posible to send cli proccess comand from one container to another in docker?",
        "docker compose access shell script from other container",
        "How to login from one container to another",
        "is it possible to call command belonging to another container in docker"
      ],
      "responses": [
        "43442276"
      ],
      "tag": "43442276"
    },
    {
      "patterns": [
        "curl: (56) Recv failure: Connection reset by peer",
        "docker: Error response from daemon: driver failed programming external connectivity on endpoint funny_golick",
        "devilbox_httpd_1 error address already in use"
      ],
      "responses": [
        "37971961"
      ],
      "tag": "37971961"
    },
    {
      "patterns": [
        "docker-compose up takes lot of time for mac but runs fine on windows",
        "Laravel Sail / Docker is too slow on Mac: optimization possible?",
        "Docker with WordPress Page Load is Painfully slow",
        "Laravel Docker For Mac Very Slowly",
        ":cached and :delegated mounted volumed performance in OSX"
      ],
      "responses": [
        "55951014"
      ],
      "tag": "55951014"
    },
    {
      "patterns": [
        "Dash app runs in local where as it throws error in server",
        "OSError: [Errno 8] Exec format error - when launching Flask app",
        "OSError: [Errno 8] Exec format error in Vagrant",
        "Dockerize ubuntu with docker for windows",
        "Dockerfile cannot run manage.py on Windows 10",
        "Flask app shows error \" OSError: [Errno 8] Exec format error \" whenever i run it on virtual machine using vagrant"
      ],
      "responses": [
        "55271912"
      ],
      "tag": "55271912"
    },
    {
      "patterns": [
        "Docker image white labelling",
        "How to prevent passwordless login from docker exec?",
        "How to prevent others from seeing code inside my container?",
        "How to protect docker file from users within a system?",
        "Restrict user from accessing code inside docker"
      ],
      "responses": [
        "51552706"
      ],
      "tag": "51552706"
    },
    {
      "patterns": [
        "How to set docker port after Published ports are discarded?",
        "can I deploy docker on google cloud VM instance without host network",
        "how to use docker bridge network on google cloud platform?"
      ],
      "responses": [
        "56555787"
      ],
      "tag": "56555787"
    },
    {
      "patterns": [
        "Dockerfile fails on build - cannot connect to docker daemon",
        "docker.sock: connect: permission denied",
        "AWS EC2 Failed to execute script docker-compose",
        "configuring docker to put files",
        "when i run docker command in ubuntu20.04 LTE on virtual box , the following error came",
        "Docker requires sudo to run",
        "How to fix Docker : \"Got permission denied while trying to connect to the Docker daemon socket \"",
        "New user account - permission denied to enter a docker"
      ],
      "responses": [
        "48957195"
      ],
      "tag": "48957195"
    },
    {
      "patterns": [
        "Cannot find the file. ERROR during connect",
        "error during connect: The system cannot find the file specified..,the docker client must be run elevated to connect",
        "docker daemon is not running for windows 10"
      ],
      "responses": [
        "52946810"
      ],
      "tag": "52946810"
    },
    {
      "patterns": [
        "Is Docker Platform Independent?",
        "How can I run windows docker containers on linux?",
        "Will(or When) Windows Containers be hosted on linux?"
      ],
      "responses": [
        "42158596"
      ],
      "tag": "42158596"
    },
    {
      "patterns": [
        "How to map a directory from docker container to host?",
        "Docker initialize host mounted volume",
        "Can't mount docker container's working directory to host"
      ],
      "responses": [
        "42848279"
      ],
      "tag": "42848279"
    },
    {
      "patterns": [
        "'cannot normalize nothing' error on Docker Hub multi-stage build with shared ARG",
        "Not Able to use ARGUMENT for ADD command in Dockerfile",
        "passing arguments to docker"
      ],
      "responses": [
        "53681522"
      ],
      "tag": "53681522"
    },
    {
      "patterns": [
        "Where is docker volume and images created on local windows 10",
        "I have created volumes with Docker Desktop, I see the volumes using \"docker volume ls\" but the folder in windows are empy",
        "Docker Desktop for Windows- Where exactly the volume is present",
        "Where Docker store volume on Windows or Mac?"
      ],
      "responses": [
        "43181654"
      ],
      "tag": "43181654"
    },
    {
      "patterns": [
        "Best way to inherit from multiple Docker images",
        "Merging two dockerfiles in one",
        "Combine multiple docker containers without copying"
      ],
      "responses": [
        "39626579"
      ],
      "tag": "39626579"
    },
    {
      "patterns": [
        "Docker container failed to spin up",
        "Docker Compose : Unable to start react app server",
        "Node container is crashing without error output",
        "React/Spring/MySQL Containerisation: Frontend Unable To Start After Pulling Image",
        "Problem running 'react-scripts start' from docker-compose"
      ],
      "responses": [
        "60895246"
      ],
      "tag": "60895246"
    }
  ]
}